{
  "add_cross_attention": false,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-APT",
    "2": "I-APT",
    "3": "B-CAMPAIGN",
    "4": "I-CAMPAIGN",
    "5": "B-EXPLOIT",
    "6": "I-EXPLOIT",
    "7": "B-FILE",
    "8": "I-FILE",
    "9": "B-HASH",
    "10": "I-HASH",
    "11": "B-INDICATOR",
    "12": "I-INDICATOR",
    "13": "B-INFRASTRUCTURE",
    "14": "I-INFRASTRUCTURE",
    "15": "B-IP",
    "16": "I-IP",
    "17": "B-MALWARE",
    "18": "I-MALWARE",
    "19": "B-METHOD",
    "20": "I-METHOD",
    "21": "B-SOFTWARE",
    "22": "I-SOFTWARE",
    "23": "B-THREAT_ACTOR",
    "24": "I-THREAT_ACTOR",
    "25": "B-TOOL",
    "26": "I-TOOL",
    "27": "B-URL",
    "28": "I-URL",
    "29": "B-VULNERABILITY",
    "30": "I-VULNERABILITY"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-APT": 1,
    "B-CAMPAIGN": 3,
    "B-EXPLOIT": 5,
    "B-FILE": 7,
    "B-HASH": 9,
    "B-INDICATOR": 11,
    "B-INFRASTRUCTURE": 13,
    "B-IP": 15,
    "B-MALWARE": 17,
    "B-METHOD": 19,
    "B-SOFTWARE": 21,
    "B-THREAT_ACTOR": 23,
    "B-TOOL": 25,
    "B-URL": 27,
    "B-VULNERABILITY": 29,
    "I-APT": 2,
    "I-CAMPAIGN": 4,
    "I-EXPLOIT": 6,
    "I-FILE": 8,
    "I-HASH": 10,
    "I-INDICATOR": 12,
    "I-INFRASTRUCTURE": 14,
    "I-IP": 16,
    "I-MALWARE": 18,
    "I-METHOD": 20,
    "I-SOFTWARE": 22,
    "I-THREAT_ACTOR": 24,
    "I-TOOL": 26,
    "I-URL": 28,
    "I-VULNERABILITY": 30,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 32987
}
